<a href="https://colab.research.google.com/github/fiofana/bootcamp-data-analytics/blob/main/sql/%5BWoMakersCode%5D_Exerc%C3%ADcios_SQL.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
%load_ext sql

In [2]:
%%sql
sqlite:///test.db

In [3]:
import sqlite3
import pandas as pd

In [4]:
conexao = sqlite3.connect('test.db')
cursor = conexao.cursor()

1. Crie uma tabela chamada "alunos" com os seguintes campos: id
(inteiro), nome (texto), idade (inteiro) e curso (texto).

In [5]:
cursor.execute('CREATE TABLE alunos(id INT, nome VARCHAR(100), idade INT, curso VARCHAR(100));')

conexao.commit()
conexao.close

2. Insira pelo menos 5 registros de alunos na tabela que você criou no
exercício anterior.

In [6]:
cursor.execute('INSERT INTO alunos(id, nome, idade, curso) VALUES (1, "Malena", 25, "Ciência da Computação");')
cursor.execute('INSERT INTO alunos(id, nome, idade, curso) VALUES (2, "Igor", 23, "Engenharia Elétrica");')
cursor.execute('INSERT INTO alunos(id, nome, idade, curso) VALUES (3, "Pedro", 20, "Engenharia Mecânica");')
cursor.execute('INSERT INTO alunos(id, nome, idade, curso) VALUES (4, "Júlia", 18, "Engenharia Mecânica");')
cursor.execute('INSERT INTO alunos(id, nome, idade, curso) VALUES (5, "Teresa", 37, "Letras");')

conexao.commit()
conexao.close

3. Consultas Básicas - Escreva consultas SQL para realizar as seguintes tarefas:

a) Selecionar todos os registros da tabela "alunos".

b) Selecionar o nome e a idade dos alunos com mais de 20 anos.

c) Selecionar os alunos do curso de "Engenharia" em ordem
alfabética.

d) Contar o número total de alunos na tabela

In [7]:
dados = cursor.execute('SELECT * FROM alunos;')

conexao.commit()
conexao.close

for aluno in dados:
    print(aluno)

(1, 'Malena', 25, 'Ciência da Computação')
(2, 'Igor', 23, 'Engenharia Elétrica')
(3, 'Pedro', 20, 'Engenharia Mecânica')
(4, 'Júlia', 18, 'Engenharia Mecânica')
(5, 'Teresa', 37, 'Letras')

In [8]:
nome_idade = cursor.execute('SELECT nome, idade FROM alunos WHERE idade>20;')

conexao.commit()
conexao.close

for aluno in nome_idade:
    print(aluno)

('Malena', 25)
('Igor', 23)
('Teresa', 37)

In [9]:
dados_eng = cursor.execute('SELECT * FROM alunos WHERE curso LIKE "Engenharia%";')

conexao.commit()
conexao.close

for aluno in dados_eng:
    print(aluno)

(2, 'Igor', 23, 'Engenharia Elétrica')
(3, 'Pedro', 20, 'Engenharia Mecânica')
(4, 'Júlia', 18, 'Engenharia Mecânica')

In [10]:
cursor.execute('SELECT COUNT(*) FROM alunos')

conexao.commit()
conexao.close

total_alunos = cursor.fetchone()[0]
print(total_alunos)

5

4. Atualização e Remoção

a) Atualize a idade de um aluno específico na tabela.

b) Remova um aluno pelo seu ID.

In [11]:
cursor.execute('UPDATE alunos SET idade = 21 WHERE id = 3')

conexao.commit()
conexao.close

In [12]:
cursor.execute('DELETE FROM alunos WHERE id = 4')

conexao.commit()
conexao.close

In [13]:
dados = cursor.execute('SELECT * FROM alunos;')

conexao.commit()
conexao.close

for aluno in dados:
    print(aluno)

(1, 'Malena', 25, 'Ciência da Computação')
(2, 'Igor', 23, 'Engenharia Elétrica')
(3, 'Pedro', 21, 'Engenharia Mecânica')
(5, 'Teresa', 37, 'Letras')

5. Criar uma Tabela e Inserir Dados

Crie uma tabela chamada "clientes" com os campos: id (chave
primária), nome (texto), idade (inteiro) e saldo (float). Insira alguns
registros de clientes na tabela.

In [14]:
cursor.execute('CREATE TABLE clientes(id INT, nome VARCHAR(100), idade INT, saldo REAL);')

cursor.execute('INSERT INTO clientes (id, nome, idade, saldo) VALUES (1, "Ana", 34, 1500.75);')
cursor.execute('INSERT INTO clientes (id, nome, idade, saldo) VALUES (2, "Bruno", 28, 950.50);')
cursor.execute('INSERT INTO clientes (id, nome, idade, saldo) VALUES (3, "Carla", 45, 2000.00);')
cursor.execute('INSERT INTO clientes (id, nome, idade, saldo) VALUES (4, "Daniel", 22, 500.00);')
cursor.execute('INSERT INTO clientes (id, nome, idade, saldo) VALUES (5, "Eduarda", 38, 3000.20);')

conexao.commit()
conexao.close

6. Consultas e Funções Agregadas

Escreva consultas SQL para realizar as seguintes tarefas:

a) Selecione o nome e a idade dos clientes com idade superior a
30 anos.

b) Calcule o saldo médio dos clientes.

c) Encontre o cliente com o saldo máximo.

d) Conte quantos clientes têm saldo acima de 1000.

In [15]:
nome_idade = cursor.execute('SELECT nome, idade FROM clientes WHERE idade>30;')

conexao.commit()
conexao.close

for cliente in nome_idade:
    print(cliente)

('Ana', 34)
('Carla', 45)
('Eduarda', 38)

In [16]:
cursor.execute('SELECT AVG(saldo) FROM clientes;')

conexao.commit()
conexao.close

saldo_medio = cursor.fetchone()[0]
print(saldo_medio)

1590.29

In [17]:
cursor.execute('SELECT nome, saldo FROM clientes ORDER BY saldo DESC LIMIT 1;')

conexao.commit()
conexao.close

maior_saldo = cursor.fetchone()[0]
print(maior_saldo)

Eduarda

In [18]:
cursor.execute('SELECT COUNT(*) AS clientes_acima_de_1000 FROM clientes WHERE saldo > 1000;')

conexao.commit()
conexao.close

acima_mil = cursor.fetchone()[0]
print(acima_mil)

3

7. Atualização e Remoção com Condições

a) Atualize o saldo de um cliente específico.

b) Remova um cliente pelo seu ID.

In [19]:
cursor.execute('UPDATE clientes SET saldo = 1600.00 WHERE nome = "Ana";')

conexao.commit()
conexao.close

In [20]:
cursor.execute('DELETE FROM clientes WHERE id = 2;')

conexao.commit()
conexao.close

8. Junção de Tabelas

Crie uma segunda tabela chamada "compras" com os campos: id
(chave primária), cliente_id (chave estrangeira referenciando o id
da tabela "clientes"), produto (texto) e valor (real). Insira algumas
compras associadas a clientes existentes na tabela "clientes".
Escreva uma consulta para exibir o nome do cliente, o produto e o
valor de cada compra.

In [21]:
cursor.execute('CREATE TABLE compras(id INTEGER PRIMARY KEY, cliente_id INTEGER, produto TEXT, valor REAL, FOREIGN KEY(cliente_id) REFERENCES clientes(id));')

cursor.execute('INSERT INTO compras (id, cliente_id, produto, valor) VALUES (1, 1, "Notebook", 1200.00);')
cursor.execute('INSERT INTO compras (id, cliente_id, produto, valor) VALUES (2, 3, "Smartphone", 800.00);')
cursor.execute('INSERT INTO compras (id, cliente_id, produto, valor) VALUES (3, 4, "Tablet", 400.00);')
cursor.execute('INSERT INTO compras (id, cliente_id, produto, valor) VALUES (4, 5, "TV", 1500.00);')
cursor.execute('INSERT INTO compras (id, cliente_id, produto, valor) VALUES (5, 3, "Smartphone", 3500.00);')

conexao.commit()
conexao.close

In [23]:
clientes_compras = cursor.execute('SELECT clientes.nome, compras.produto, compras.valor FROM compras JOIN clientes ON compras.cliente_id = clientes.id;')

for compra in clientes_compras:
    print(compra)

('Ana', 'Notebook', 1200.0)
('Carla', 'Smartphone', 800.0)
('Daniel', 'Tablet', 400.0)
('Eduarda', 'TV', 1500.0)
('Carla', 'Smartphone', 3500.0)